# ──────────────────────────────────────────────
# Dotfiles - 核心工具清单
# 只包含这套 dotfiles 配置直接依赖的工具
# 运行：brew bundle
# ──────────────────────────────────────────────

# Shell
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "starship"
brew "atuin"
brew "zoxide"

# Node
brew "fnm"

# 终端复用
brew "tmux"
brew "zellij"

# 编辑器
brew "neovim"
brew "tree-sitter"

# 文件与搜索
brew "exa"
brew "bat"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "yazi"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "lsd"

# Git
brew "git"
brew "gh"
brew "lazygit"

# 包管理
brew "pnpm"
brew "stow"
brew "wget"

# 开发辅助
brew "direnv"
brew "lazydocker"
brew "rustup-init"
brew "cowsay"
